print('Введіть 9 значень (х чи 0) для визначення переможця: \n\n'
    '_[0][0]_|_[0][1]_|_[0][2]_\n'
    '_[1][0]_|_[1][1]_|_[1][2]_\n'
    ' [2][0] | [2][1] | [2][2] \n')
A = []
B = []
for j in range(3):
    A = []
    for i in range(3):
        n = input(f'Введіть значення [{j}][{i}]: ')
        if n == 'x' or n == '0':
            A.append(n)
        else:
            print('Лише x чи 0. Перезапустіть ввод результату гри')
            exit()
    B.append(A)
print(B[0], end='\n')
print(B[1], end='\n')
print(B[2], end='\n')
if B[0][0] == B[0][1] == B[0][2] == 'x' or \
B[1][0] == B[1][1] == B[1][2] == 'x' or \
B[2][0] == B[2][1] == B[2][2] == 'x' or \
B[0][0] == B[1][0] == B[2][0] == 'x' or \
B[0][1] == B[1][1] == B[2][1] == 'x' or \
B[0][2] == B[1][2] == B[2][2] == 'x' or \
B[0][0] == B[1][1] == B[2][2] == 'x' or \
B[0][2] == B[1][1] == B[2][0] == 'x':
    print('Переміг гравець x!')
    exit()
elif B[0][0] == B[0][1] == B[0][2] == '0' or \
B[1][0] == B[1][1] == B[1][2] == '0' or \
B[2][0] == B[2][1] == B[2][2] == '0' or \
B[0][0] == B[1][0] == B[2][0] == '0' or \
B[0][1] == B[1][1] == B[2][1] == '0' or \
B[0][2] == B[1][2] == B[2][2] == '0' or \
B[0][0] == B[1][1] == B[2][2] == '0' or \
B[0][2] == B[1][1] == B[2][0] == '0':
    print('Переміг гравець 0!')
    exit()
else:
    print('Нічия!')
    exit()
